---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegenFailure
source: html/240dad64-05a0-cc24-61ed-bfccf0d01461.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegenFailure Property

Regeneration Failure.

## Syntax (C#)
```csharp
public static FailureDefinitionId RegenFailure { get; }
```